<a href="https://colab.research.google.com/github/vnestory/datascience/blob/main/HURU_School_Introduction_to_SQL_Database_Commands.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### **Introduction to SQL Database Commands**

In [ ]:
# installing the sqlite database

!pip install db-sqlite3

Requirement already satisfied: db-sqlite3 in /usr/local/lib/python3.7/dist-packages (0.0.1)
Requirement already satisfied: db in /usr/local/lib/python3.7/dist-packages (from db-sqlite3) (0.1.1)
Requirement already satisfied: antiorm in /usr/local/lib/python3.7/dist-packages (from db->db-sqlite3) (1.2.1)

In [ ]:
# import the required libraries sqlite, pandas, and date time
import sqlite3
import pandas as pd
from datetime import date

In [ ]:
#connect with test db

db =sqlite3.connect("test.db")

# drop the table results if it exist
db.execute("drop table if exists results")
# Define database schema
try:
  db.execute("create table results (Name text, Date datetime,Phone text, Email text)")
except:
  print("table already exist")

In [ ]:
# connect again
db =sqlite3.connect("test.db")

In [ ]:
# Create data

Name ="Adeleke"
Date =date.today().strftime("%d-%m-%Y")
Phone ="+25872928002"
Email ="adeleke@gmail.com"

In [ ]:
cmd = "insert into results(Name, Phone,Date,Email) values('{}','{}','{}','{}')".format(Name,Phone,Date,Email)
db.execute(cmd)
db.commit()

**Querying**

In [ ]:
# Querying the data in the database using SQL

db = sqlite3.connect("test.db")
rs = db.execute('SELECT * FROM results')
for row in rs:
    print (row)

('Adeleke', '28-04-2021', '+25872928002', 'adeleke@gmail.com')

In [ ]:
# reading the dataset into pandas for more downstream operations

db = sqlite3.connect("test.db")
qry = """

SELECT * FROM results 

"""
df = pd.read_sql_query(qry, db)

df.head()

      Name        Date         Phone              Email
0  Adeleke  28-04-2021  +25872928002  adeleke@gmail.com